In [1]:
import pandas as pd
import numpy as np

### Q1

In [29]:
student_df = pd.DataFrame({'School':['Business','Law','Engineering']},index=['James','Mike','Sally'])
staff_df = pd.DataFrame({'Role':['Director of HR','Course liasion','Grader']},index=['Kelly','Sally','James'])

In [30]:
student_df.index.names=['Name']
staff_df.index.names=['Name']

In [19]:

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

### Q2

In [34]:
staff_df.drop('Kelly',axis=0)

                 Role
Name
Sally  Course liasion
James          Grader

### Q3

In [38]:
import pandas as pd
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
my_categories = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], ordered=True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]

In [39]:
result

excellent    A-
good         B+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

### Q5

In [40]:
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

5

### Q9

In [41]:
import pandas as pd
pd.Period('01/12/2019', 'M') + 5

Period('2019-06', 'M')

### Q7

In [59]:
student_df=pd.DataFrame({'First Name':['James','Mike','Sally'],'Last Name':['Hammond','Smith','Brooks'],'School':['Business','Law','Engineering']})
staff_df=pd.DataFrame({'First Name':['Kelly','Sally','James'],'Last Name':['Desjardins','Brooks','Wilde'],'Role':['Director of HR','Course Liasion','Grader']})

In [60]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [61]:
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course Liasion
2      James       Wilde          Grader

In [74]:
result_df

  First Name Last Name            Role       School
0      James   Hammond             NaN     Business
1       Mike     Smith             NaN          Law
2      Sally    Brooks  Course Liasion  Engineering

In [67]:
result_df = pd.merge(student_df, staff_df, how='right', on=['First Name', 'Last Name'])

In [68]:
result_df

  First Name   Last Name       School            Role
0      Kelly  Desjardins          NaN  Director of HR
1      Sally      Brooks  Engineering  Course Liasion
2      James       Wilde          NaN          Grader

In [69]:
result_df = pd.merge(student_df, staff_df, how='outer', on=['First Name', 'Last Name'])

In [70]:
result_df

  First Name   Last Name       School            Role
0      James     Hammond     Business             NaN
1       Mike       Smith          Law             NaN
2      Sally      Brooks  Engineering  Course Liasion
3      Kelly  Desjardins          NaN  Director of HR
4      James       Wilde          NaN          Grader